### write a program to take a name and age from the user and print a greeting message.

In [1]:
name = input("Enter your name: ")
age = int(input("Enter your age: "))

print(f"Hello {name} welcome home! please confirm your age is {age}")

Enter your name:  Chandru
Enter your age:  23

Hello Chandru welcome home! please confirm your age is 23

### create a list of numbers and print only even numbers using a for loop

In [5]:
numbers = []
for i in range(1,100):
    if i%2==0:
        numbers.append(i)

In [6]:
numbers

[2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50,
 52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

### write a program that handles division by zero using try-except

In [7]:
try:
    pass
except:
    pass

In [8]:
num = int(input("Enter Num: "))
den = int(input("Enter Den: "))

ans = num/den

print(ans)

Enter Num:  45
Enter Den:  0

ZeroDivisionError: division by zero

In [12]:
num = int(input("Enter Num: "))
den = int(input("Enter Den: "))

try:
    ans = num/den
    print(ans)
except ZeroDivisionError:
    print("Invalid input. Please enter a number other than '0'")

except ValueError:
    print("Invalid input. Please enter a number other than alphabet.")

finally:
    print("program ended!!!")

Enter Num:  45
Enter Den:  r

ValueError: invalid literal for int() with base 10: 'r'

### given a string, count how many vowels it has.

In [13]:
word = input("Enter a string: ").lower()

count=0

for i in word:
    if i in "aeiou":
       count+=1

print("Total No. of Vowels are:",count)

Enter a string:  ChandrU

Total No. of Vowels are: 2

### Reverse a list without using built -in functions

In [14]:
original_list = [1,2,3,4,5,6,7,8,9,10]

original_list.reverse()

original_list

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [15]:
original_list_2 = [11,12,13,14,15]

In [20]:
original_list_2 = [11,12,13,14,15]

new_list = []

i =len(original_list_2) - 1

while i>=0:
    new_list.append(original_list_2[i])
    i -=1

new_list

[15, 14, 13, 12, 11]

### create a dictionary with atleast 5-key value pairs and print them

In [26]:
team = {
    "first_name":["Chandru","Lokesh","Yokesh","Karthik","Naveen"],
    "last_name":["M D","U E","M","R","V"],
    "age":[24,25,28,24,25],
    "location":["Germany","USA","New Zealand","UK","UAE"],
    "Occupation":["AI Engineer","CEO","CTO","Electronics Expert","IT Engineer"]
}

In [27]:
print(team)

{'first_name': ['Chandru', 'Lokesh', 'Yokesh', 'Karthik', 'Naveen'], 'last_name': ['M D', 'U E', 'M', 'R', 'V'], 'age': [24, 25, 28, 24, 25], 'location': ['Germany', 'USA', 'New Zealand', 'UK', 'UAE'], 'Occupation': ['AI Engineer', 'CEO', 'CTO', 'Electronics Expert', 'IT Engineer']}

In [28]:
team

{'first_name': ['Chandru', 'Lokesh', 'Yokesh', 'Karthik', 'Naveen'],
 'last_name': ['M D', 'U E', 'M', 'R', 'V'],
 'age': [24, 25, 28, 24, 25],
 'location': ['Germany', 'USA', 'New Zealand', 'UK', 'UAE'],
 'Occupation': ['AI Engineer',
  'CEO',
  'CTO',
  'Electronics Expert',
  'IT Engineer']}

In [24]:
import pandas as pd

In [30]:
team_details = pd.DataFrame(data=team)

In [32]:
team_details.to_csv(path_or_buf="team_details.csv")

In [33]:
df = pd.read_csv("team_details.csv")

In [34]:
df.shape

(5, 6)

In [35]:
df.head()

   Unnamed: 0 first_name last_name  age     location          Occupation
0           0    Chandru       M D   24      Germany         AI Engineer
1           1     Lokesh       U E   25          USA                 CEO
2           2     Yokesh         M   28  New Zealand                 CTO
3           3    Karthik         R   24           UK  Electronics Expert
4           4     Naveen         V   25          UAE         IT Engineer

### write a python code to read a csv and print the top 5 rows

In [36]:
df = pd.read_csv("employee_data.csv")

In [38]:
df.shape

(8, 5)

### create a dataframe from a dictionary

In [39]:
team = {
    "first_name":["Chandru","Lokesh","Yokesh","Karthik","Naveen"],
    "last_name":["M D","U E","M","R","V"],
    "age":[24,25,28,24,25],
    "location":["Germany","USA","New Zealand","UK","UAE"],
    "Occupation":["AI Engineer","CEO","CTO","Electronics Expert","IT Engineer"]
}
team_details = pd.DataFrame(data=team)

### Replace all missing values in a dataframe with the column's mean

In [40]:
df

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech      NaN  12-11-2020

In [42]:
df["Salary"].mean()

np.float64(62500.0)

In [44]:
df["Salary"].fillna(value=df["Salary"].mean(),inplace=True)

In [45]:
df

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech  62500.0  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech  62500.0  12-11-2020

In [46]:
df["Age"].fillna(value=df["Age"].mean())

0    29.000000
1    31.000000
2    31.857143
3    29.000000
4    28.000000
5    35.000000
6    40.000000
7    31.000000
Name: Age, dtype: float64

### Filter rows in a df where the 'age' column is > 30

In [47]:
df[df["Age"]>30]

    Name   Age Department   Salary   Join_Date
1  Nasir  31.0    IT Tech  62500.0  12-11-2020
5  Navin  35.0    Support  72000.0  19-08-2023
6    NaN  40.0         IT  64000.0  10-09-2022
7  Nasir  31.0    IT Tech  62500.0  12-11-2020

### THE END!!!